While making curved beam type "[Type Name]" 2D Detail Component elements were not created
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NotBentDetailComponent { get; }
  Visual Basic
Public Shared ReadOnly Property NotBentDetailComponent As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NotBentDetailComponent {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BendFailures Class
  Autodesk.Revit.DB Namespace